{
  "_name_or_path": "C:\\Users\\karti\\.cache\\huggingface\\hub\\models--sentence-transformers--clip-ViT-B-32\\snapshots\\11fb331c2c388748c110926aa8013161cb5a85b5\\0_CLIPModel",
  "architectures": [
    "CLIPModel"
  ],
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "projection_dim": 512,
  "text_config": {
    "bos_token_id": 0,
    "dropout": 0.0,
    "eos_token_id": 2,
    "gradient_checkpointing": false,
    "model_type": "clip_text_model"
  },
  "torch_dtype": "float32",
  "transformers_version": "4.39.2",
  "vision_config": {
    "dropout": 0.0,
    "gradient_checkpointing": false,
    "model_type": "clip_vision_model"
  }
}
